D0cCmagic/MSPM0G3507/pai_diyiwen_okk/last_get/ncontroller_v6_mspm0g3507_202507_31/ncontroller_v6_mspm0g3507_r1_20250520/ti_msp_dl_config.h
/* Defines for S3: GPIOB.21 with pinCMx 49 on package pin 20 */
#define KEYB_S3_PIN                                             (DL_GPIO_PIN_21)
#define KEYB_S3_IOMUX                                            (IOMUX_PINCM49)
/* Port definition for Pin Group GPIO_RGB */
#define GPIO_RGB_PORT                                                    (GPIOB)

/* Defines for RED: GPIOB.26 with pinCMx 57 on package pin 28 */
#define GPIO_RGB_RED_PIN                                        (DL_GPIO_PIN_26)
#define GPIO_RGB_RED_IOMUX                                       (IOMUX_PINCM57)
/* Defines for GREEN: GPIOB.27 with pinCMx 58 on package pin 29 */
#define GPIO_RGB_GREEN_PIN                                      (DL_GPIO_PIN_27)
#define GPIO_RGB_GREEN_IOMUX                                     (IOMUX_PINCM58)
/* Defines for BLUE: GPIOB.22 with pinCMx 50 on package pin 21 */
#define GPIO_RGB_BLUE_PIN                                       (DL_GPIO_PIN_22)
#define GPIO_RGB_BLUE_IOMUX                                      (IOMUX_PINCM50)
/* Port definition for Pin Group PORTA */
#define PORTA_PORT                                                       (GPIOA)

/* Defines for LCD_SCL: GPIOA.17 with pinCMx 39 on package pin 10 */
#define PORTA_LCD_SCL_PIN                                       (DL_GPIO_PIN_17)
#define PORTA_LCD_SCL_IOMUX                                      (IOMUX_PINCM39)
/* Defines for beep: GPIOA.27 with pinCMx 60 on package pin 31 */
#define PORTA_beep_PIN                                          (DL_GPIO_PIN_27)
#define PORTA_beep_IOMUX                                         (IOMUX_PINCM60)
/* Defines for GRAY_BIT0: GPIOA.31 with pinCMx 6 on package pin 39 */
#define PORTA_GRAY_BIT0_PIN                                     (DL_GPIO_PIN_31)
#define PORTA_GRAY_BIT0_IOMUX                                     (IOMUX_PINCM6)
/* Defines for GRAY_BIT1: GPIOA.28 with pinCMx 3 on package pin 35 */
#define PORTA_GRAY_BIT1_PIN                                     (DL_GPIO_PIN_28)
#define PORTA_GRAY_BIT1_IOMUX                                     (IOMUX_PINCM3)
/* Defines for GRAY_BIT2: GPIOA.1 with pinCMx 2 on package pin 34 */
#define PORTA_GRAY_BIT2_PIN                                      (DL_GPIO_PIN_1)
#define PORTA_GRAY_BIT2_IOMUX                                     (IOMUX_PINCM2)
/* Defines for GRAY_BIT3: GPIOA.0 with pinCMx 1 on package pin 33 */
#define PORTA_GRAY_BIT3_PIN                                      (DL_GPIO_PIN_0)
#define PORTA_GRAY_BIT3_IOMUX                                     (IOMUX_PINCM1)
/* Defines for GRAY_BIT4: GPIOA.25 with pinCMx 55 on package pin 26 */
#define PORTA_GRAY_BIT4_PIN                                     (DL_GPIO_PIN_25)
#define PORTA_GRAY_BIT4_IOMUX                                    (IOMUX_PINCM55)
/* Defines for GRAY_BIT5: GPIOA.24 with pinCMx 54 on package pin 25 */
#define PORTA_GRAY_BIT5_PIN                                     (DL_GPIO_PIN_24)
#define PORTA_GRAY_BIT5_IOMUX                                    (IOMUX_PINCM54)
/* Defines for GRAY_BIT10: GPIOA.16 with pinCMx 38 on package pin 9 */
#define PORTA_GRAY_BIT10_PIN                                    (DL_GPIO_PIN_16)
#define PORTA_GRAY_BIT10_IOMUX                                   (IOMUX_PINCM38)
/* Port definition for Pin Group PORTB */
#define PORTB_PORT                                                       (GPIOB)

/* Defines for LCD_SDA: GPIOB.15 with pinCMx 32 on package pin 3 */
#define PORTB_LCD_SDA_PIN                                       (DL_GPIO_PIN_15)
#define PORTB_LCD_SDA_IOMUX                                      (IOMUX_PINCM32)
/* Defines for D3_1: GPIOB.8 with pinCMx 25 on package pin 60 */
#define PORTB_D3_1_PIN                                           (DL_GPIO_PIN_8)
#define PORTB_D3_1_IOMUX                                         (IOMUX_PINCM25)
/* Defines for D3_2: GPIOB.9 with pinCMx 26 on package pin 61 */
#define PORTB_D3_2_PIN                                           (DL_GPIO_PIN_9)
#define PORTB_D3_2_IOMUX                                         (IOMUX_PINCM26)
/* Defines for D3_3: GPIOB.10 with pinCMx 27 on package pin 62 */
#define PORTB_D3_3_PIN                                          (DL_GPIO_PIN_10)
#define PORTB_D3_3_IOMUX                                         (IOMUX_PINCM27)
/* Defines for D3_4: GPIOB.11 with pinCMx 28 on package pin 63 */
#define PORTB_D3_4_PIN                                          (DL_GPIO_PIN_11)
#define PORTB_D3_4_IOMUX                                         (IOMUX_PINCM28)
/* Defines for D3_5: GPIOB.12 with pinCMx 29 on package pin 64 */
#define PORTB_D3_5_PIN                                          (DL_GPIO_PIN_12)
#define PORTB_D3_5_IOMUX                                         (IOMUX_PINCM29)
/* Defines for W25Q64_CS: GPIOB.25 with pinCMx 56 on package pin 27 */
#define PORTB_W25Q64_CS_PIN                                     (DL_GPIO_PIN_25)
#define PORTB_W25Q64_CS_IOMUX                                    (IOMUX_PINCM56)
/* Defines for RIGHT_PULSE: GPIOB.4 with pinCMx 17 on package pin 52 */
// pins affected by this interrupt request:["RIGHT_PULSE","LEFT_PULSE"]
#define PORTB_INT_IRQN                                          (GPIOB_INT_IRQn)
#define PORTB_INT_IIDX                          (DL_INTERRUPT_GROUP1_IIDX_GPIOB)
#define PORTB_RIGHT_PULSE_IIDX                               (DL_GPIO_IIDX_DIO4)
#define PORTB_RIGHT_PULSE_PIN                                    (DL_GPIO_PIN_4)
#define PORTB_RIGHT_PULSE_IOMUX                                  (IOMUX_PINCM17)
/* Defines for LEFT_PULSE: GPIOB.5 with pinCMx 18 on package pin 53 */
#define PORTB_LEFT_PULSE_IIDX                                (DL_GPIO_IIDX_DIO5)
#define PORTB_LEFT_PULSE_PIN                                     (DL_GPIO_PIN_5)
#define PORTB_LEFT_PULSE_IOMUX                                   (IOMUX_PINCM18)
/* Defines for RIGHT_DIR: GPIOB.6 with pinCMx 23 on package pin 58 */
#define PORTB_RIGHT_DIR_PIN                                      (DL_GPIO_PIN_6)
#define PORTB_RIGHT_DIR_IOMUX                                    (IOMUX_PINCM23)
/* Defines for LEFT_DIR: GPIOB.7 with pinCMx 24 on package pin 59 */
#define PORTB_LEFT_DIR_PIN                                       (DL_GPIO_PIN_7)
#define PORTB_LEFT_DIR_IOMUX                                     (IOMUX_PINCM24)
/* Defines for LCD_RST: GPIOB.16 with pinCMx 33 on package pin 4 */
#define PORTB_LCD_RST_PIN                                       (DL_GPIO_PIN_16)
#define PORTB_LCD_RST_IOMUX                                      (IOMUX_PINCM33)
/* Defines for LCD_DC: GPIOB.17 with pinCMx 43 on package pin 14 */
#define PORTB_LCD_DC_PIN                                        (DL_GPIO_PIN_17)
#define PORTB_LCD_DC_IOMUX                                       (IOMUX_PINCM43)
/* Defines for LCD_CS: GPIOB.20 with pinCMx 48 on package pin 19 */
#define PORTB_LCD_CS_PIN                                        (DL_GPIO_PIN_20)
#define PORTB_LCD_CS_IOMUX                                       (IOMUX_PINCM48)
/* Defines for GRAY_BIT6: GPIOB.24 with pinCMx 52 on package pin 23 */
#define PORTB_GRAY_BIT6_PIN                                     (DL_GPIO_PIN_24)
#define PORTB_GRAY_BIT6_IOMUX                                    (IOMUX_PINCM52)
/* Defines for GRAY_BIT7: GPIOB.23 with pinCMx 51 on package pin 22 */
#define PORTB_GRAY_BIT7_PIN                                     (DL_GPIO_PIN_23)
#define PORTB_GRAY_BIT7_IOMUX                                    (IOMUX_PINCM51)
/* Defines for GRAY_BIT8: GPIOB.19 with pinCMx 45 on package pin 16 */
#define PORTB_GRAY_BIT8_PIN                                     (DL_GPIO_PIN_19)
#define PORTB_GRAY_BIT8_IOMUX                                    (IOMUX_PINCM45)
/* Defines for GRAY_BIT9: GPIOB.18 with pinCMx 44 on package pin 15 */
#define PORTB_GRAY_BIT9_PIN                                     (DL_GPIO_PIN_18)
#define PORTB_GRAY_BIT9_IOMUX                                    (IOMUX_PINCM44)
/* Defines for GRAY_BIT11: GPIOB.13 with pinCMx 30 on package pin 1 */
#define PORTB_GRAY_BIT11_PIN                                    (DL_GPIO_PIN_13)
#define PORTB_GRAY_BIT11_IOMUX                                   (IOMUX_PINCM30)
/* Defines for HEATER: GPIOB.0 with pinCMx 12 on package pin 47 */
#define PORTB_HEATER_PIN                                         (DL_GPIO_PIN_0)
#define PORTB_HEATER_IOMUX                                       (IOMUX_PINCM12)
/* Port definition for Pin Group SPI0 */
#define SPI0_PORT                                                        (GPIOA)

/* Defines for SCLK: GPIOA.12 with pinCMx 34 on package pin 5 */
#define SPI0_SCLK_PIN                                           (DL_GPIO_PIN_12)
#define SPI0_SCLK_IOMUX                                          (IOMUX_PINCM34)
/* Defines for MOSI: GPIOA.14 with pinCMx 36 on package pin 7 */
#define SPI0_MOSI_PIN                                           (DL_GPIO_PIN_14)
#define SPI0_MOSI_IOMUX                                          (IOMUX_PINCM36)
/* Defines for MISO: GPIOA.13 with pinCMx 35 on package pin 6 */
#define SPI0_MISO_PIN                                           (DL_GPIO_PIN_13)
#define SPI0_MISO_IOMUX                                          (IOMUX_PINCM35)
/* Port definition for Pin Group STEP_MOTOR_DIR */
#define STEP_MOTOR_DIR_PORT                                              (GPIOA)

/* Defines for STEP_MOTOR_DIR_1: GPIOA.23 with pinCMx 53 on package pin 24 */
#define STEP_MOTOR_DIR_STEP_MOTOR_DIR_1_PIN                     (DL_GPIO_PIN_23)
#define STEP_MOTOR_DIR_STEP_MOTOR_DIR_1_IOMUX                    (IOMUX_PINCM53)
/* Defines for STEP_MOTOR_DIR_2: GPIOA.2 with pinCMx 7 on package pin 42 */
#define STEP_MOTOR_DIR_STEP_MOTOR_DIR_2_PIN                      (DL_GPIO_PIN_2)
#define STEP_MOTOR_DIR_STEP_MOTOR_DIR_2_IOMUX                     (IOMUX_PINCM7)
/* Port definition for Pin Group GPIO_B_01 */
#define GPIO_B_01_PORT                                                   (GPIOB)

/* Defines for D0cC: GPIOB.1 with pinCMx 13 on package pin 48 */
#define GPIO_B_01_D0cC_PIN                                       (DL_GPIO_PIN_1)
#define GPIO_B_01_D0cC_IOMUX                                     (IOMUX_PINCM13)



/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_SYSCTL_CLK_init(void);
void SYSCFG_DL_PWM_0_init(void);
void SYSCFG_DL_PWM_1_init(void);
void SYSCFG_DL_PWM_2_init(void);
void SYSCFG_DL_TIMER_G0_init(void);
void SYSCFG_DL_TIMER_G6_init(void);
void SYSCFG_DL_TIMER_G8_init(void);
void SYSCFG_DL_TIMER_G12_init(void);
void SYSCFG_DL_I2C_0_init(void);
void SYSCFG_DL_UART_0_init(void);
void SYSCFG_DL_UART_1_init(void);
void SYSCFG_DL_UART_2_init(void);
void SYSCFG_DL_DMA_init(void);

void SYSCFG_DL_SYSTICK_init(void);

bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
